sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
/*
 * =============================================================
 * Drawing Application - MCU Side (MCXC444 + FreeRTOS)
 * =============================================================
 *
 * Project Setup (MCUXpresso):
 *   1. New C/C++ Project -> FRDM-MCXC444
 *   2. SDK Components:
 *      - Operating System -> RTOS
 *      - Others -> RTOS -> Heap -> FreeRTOS heap 4 (UNCHECK heap 5)
 *      - Project Template -> RTOS
 *   3. Delete generated main code, paste this file.
 *   4. In FreeRTOSConfig_Gen.h set:
 *      - configUSE_TIME_SLICING  1
 *      - configUSE_PREEMPTION    1
 *
 * Sensors (all on MCU, directly wired):
 *   - 2x Rotary Encoders  -> pen X/Y   (interrupt-driven)
 *   - External Button      -> pen up/down (interrupt-driven)
 *   - Joystick VRx (ADC)   -> submit / prompt-request (polled,
 *                                 active = tilt toward X=0)
 *   - MPU-6050 Gyro/Accel  -> erase      (polled via I2C)
 *
 * Actuators (on MCU):
 *   - SMD RGB LED  -> pen-state / rating feedback
 *   - Passive Buzzer -> boundary-hit warning tone
 *
 * Communication:
 *   UART2 <-> ESP32 (115200 baud, bidirectional, packetized)
 *   MCU -> ESP32:  $S,x,y,penDown,erase,submit,promptRequest\n
 *   ESP32 -> MCU:  $C,RESULT,<0|1>\n   $C,PROMPT,1\n
 *
 * =============================================================
 * PIN MAP - ACTIVE-LOW / ACTIVE-HIGH assumptions noted.
 *           VERIFY against your FRDM-MCXC444 header pinout.
 * =============================================================
 *
 *  Function          Pin      Port   Notes
 *  ----------------  -------  -----  -------------------------
 *  Encoder 1 CLK     PTA5    PORTA  Interrupt (falling edge)
 *  Encoder 2 CLK     PTA13   PORTA  Interrupt (falling edge)
 *  Button             PTA12   PORTA  Interrupt (rising edge) KY-004
 *  Encoder 1 DT      PTC1    PORTC  GPIO input (read in ISR)
 *  Encoder 2 DT      PTC2    PORTC  GPIO input (read in ISR)
 *  Joystick VRx      PTB0    PORTB  ADC0_SE8 (polled, LOW=active)
 *  LED Red            PTD2    PORTD  GPIO output
 *  LED Green          PTD4    PORTD  GPIO output
 *  LED Blue           PTD6    PORTD  GPIO output
 *  Buzzer (active)    PTE20   PORTE  GPIO output (boundary beep)
 *  Buzzer (passive)   PTE30   PORTE  TPM0_CH3 PWM output (result tunes)
 *  UART2 TX           PTE22   PORTE  MUX 4 -> ESP32 RX
 *  UART2 RX           PTE23   PORTE  MUX 4 -> ESP32 TX
 *  I2C0 SCL           PTB2    PORTB  MUX 2 -> MPU-6050 SCL
 *  I2C0 SDA           PTB3    PORTB  MUX 2 -> MPU-6050 SDA
 *
 *  Also connect:
 *    - MCU GND <-> ESP32 GND (common ground!)
 *    - MPU-6050 VCC -> 3.3 V, GND -> GND
 *    - Encoders / touch / button VCC -> 3.3 V, GND -> GND
 *
 * =============================================================
 */

/* -- Standard Libraries -------------------------------------- */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/* -- NXP Board Support --------------------------------------- */
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "fsl_debug_console.h"

/* -- FreeRTOS ------------------------------------------------ */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* =============================================================
 * SECTION 1 - Pin Definitions
 * =============================================================
 * Change these if your wiring differs.
 */

/* Encoder 1 (X-axis) */
#define ENC1_CLK_PIN    5       /* PTA5 - interrupt source     */
#define ENC1_DT_PIN     1       /* PTC1 - direction sense      */

/* Encoder 2 (Y-axis) */
#define ENC2_CLK_PIN    13      /* PTA13 - interrupt source    */
#define ENC2_DT_PIN     2       /* PTC2 - direction sense      */

/* External push-button (pen up / pen down) */
#define BTN_PIN         12      /* PTA12 - external KY-004 button */

/* Joystick VRx analog input (replaces legacy touch-sensor DO).
 * PTB0 is ADC0_SE8. "Activate" = tilt toward X=0 (low voltage).
 *
 * Armed / fire-and-rearm model:
 *   - FIRE once when vrx drops below LOW_THRESH.
 *   - After firing, DISARM so holding the stick does not repeat.
 *   - RE-ARM when vrx climbs back above REARM_THRESH.
 *
 * REARM sits only a small margin above LOW so that even a
 * sloppy release on a wobbly breadboard clears the arm gate.
 * Noise robustness rides on the ADC's 32-sample hardware
 * averaging (see readJoystickX), not on a wide hysteresis band. */
#define JOY_X_PIN          0U      /* PTB0 == ADC0_SE8         */
#define JOY_ADC_CHANNEL    8U      /* ADC0_SE8                 */
#define JOY_X_LOW_THRESH   1200U   /* fire below this          */
#define JOY_X_REARM_THRESH 1400U   /* re-arm above this        */

/* SMD RGB LED (common-cathode assumed: HIGH = ON)
 * If yours is common-anode, swap PSOR <-> PCOR in setLedColor() */
#define LED_R_PIN       2       /* PTD2 */
#define LED_G_PIN       4       /* PTD4 */
#define LED_B_PIN       6       /* PTD6 */

/* Active buzzer (boundary beep) - just needs HIGH/LOW */
#define ACTIVE_BUZZER_PIN   20      /* PTE20 */

/* Passive buzzer (result tunes) - needs square wave */
#define PASSIVE_BUZZER_PIN  30      /* PTE30 */
#define PASSIVE_BUZZER_TPM          TPM0
#define PASSIVE_BUZZER_TPM_CHANNEL  3U
#define PASSIVE_BUZZER_TPM_PRESCALE 4U   /* divide by 16 */
#define PASSIVE_BUZZER_TPM_CLK_SRC  1U   /* SIM TPMSRC = MCGPLLCLK/MCGFLLCLK */

/* UART2 to ESP32 */
#define UART_TX_PIN     22      /* PTE22, MUX 4 */
#define UART_RX_PIN     23      /* PTE23, MUX 4 */

/* I2C0 to MPU-6050 */
#define I2C_SCL_PIN     2       /* PTB2, MUX 2 */
#define I2C_SDA_PIN     3       /* PTB3, MUX 2 */

/* Set to 0 to disable gyroscope code (for testing without hardware) */
#define ENABLE_GYRO     1

/* =============================================================
 * SECTION 2 - Application Constants
 * ============================================================= */

#define BAUD_RATE           115200
#define UART2_INT_PRIO      128     /* Lower urgency than GPIO */

#define MAX_MSG_LEN         128
#define QUEUE_LEN           10

