sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
#define CANVAS_WIDTH        128
#define CANVAS_HEIGHT       128
#define CANVAS_CENTER_X     (CANVAS_WIDTH / 2)
#define CANVAS_CENTER_Y     (CANVAS_HEIGHT / 2)

/* MPU-6050 I2C address (AD0 pin LOW -> 0x68) */
#define MPU6050_ADDR            0x68
#define MPU6050_REG_PWR_MGMT_1  0x6B
#define MPU6050_REG_ACCEL_XOUT_H 0x3B

/* Shake detection: full-resolution accel deltas + short-window energy.
 * A valid shake needs multiple high-motion samples in a short window. */
#define SHAKE_MOTION_WINDOW_SAMPLES       5U
#define SHAKE_SAMPLE_DELTA_THRESHOLD      3500U
#define SHAKE_ENERGY_THRESHOLD            40000U
#define SHAKE_REQUIRED_HOT_SAMPLES        2U
#define SHAKE_TRIGGER_LOCKOUT_MS          700U
#define SHAKE_STALE_READ_LIMIT            5U
#define SHAKE_RECOVER_REASON_STALE        1U
#define SHAKE_RECOVER_REASON_I2C_TIMEOUT  2U
#define SHAKE_RECOVER_REASON_I2C_NACK     3U

/* Temporary shake telemetry (debug console, not protocol UART2). */
#define ENABLE_INPUT_TELEMETRY            1
#define INPUT_TELEMETRY_PERIOD_MS         150U

/* Timing */
#define DEBOUNCE_MS         200
#define SENSOR_POLL_MS      50
#define GYRO_POLL_DIVIDER   1       /* read gyro every poll = 50ms */
#define UART_SEND_MS        5
#define BUZZER_TONE_TICKS   1       /* ~ 1 ms half-period -> ~500 Hz */
#define BUZZER_DURATION     50      /* half-periods per beep        */
#define ERASE_RETRY_FRAMES  20      /* keep erase asserted up to 100ms unless ESP32 ACKs */

/* =============================================================
 * SECTION 3 - Data Types
 * ============================================================= */

/* Encoder event pushed from ISR -> encoder task via queue */
typedef struct {
    int8_t  delta;   /* +1 or -1                */
    uint8_t axis;    /* 0 = X (enc1), 1 = Y (enc2) */
} EncoderEvent_t;

/* UART message pushed from ISR -> recv task via queue */
typedef struct {
    char message[MAX_MSG_LEN];
} UartMessage_t;

/* Shared pen state (protected by mutex) */
typedef struct {
    int16_t x;
    int16_t y;
    uint8_t penDown;    /* 1 = drawing, 0 = lifted          */
    uint8_t erase;      /* 1 = erase requested, retry until ACK/timeout */
    uint8_t submit;     /* 1 = submit requested, held until RESULT */
    uint8_t promptRequest; /* 1 = request next prompt, held until PROMPT */
    uint8_t eraseRetryFrames;
} PenState_t;

typedef struct {
    uint32_t scoreWindow[SHAKE_MOTION_WINDOW_SAMPLES];
    uint8_t hotWindow[SHAKE_MOTION_WINDOW_SAMPLES];
    uint32_t scoreSum;
    uint8_t nextSampleIndex;
    uint8_t sampleCount;
    uint8_t hotSampleCount;
} ShakeMotionState_t;

typedef struct {
    int16_t accelX;
    int16_t accelY;
    int16_t accelZ;
    uint16_t deltaX;
    uint16_t deltaY;
    uint16_t deltaZ;
    uint32_t motionScore;
    uint32_t motionEnergy;
    uint8_t motionHotCount;
    uint8_t lockoutActive;
    uint16_t lockoutMsRemaining;
    uint8_t shakeDetected;
    uint8_t staleCount;
    uint16_t recoveryCount;
    uint8_t i2cErrorSeen;
} InputTelemetry_t;

/* LED colour helper */
typedef enum {
    LED_OFF,
    LED_RED,
    LED_GREEN,
    LED_BLUE,
    LED_PURPLE,
    LED_ORANGE,
    LED_WHITE
} LedColor_t;

typedef enum {
    ROUND_PHASE_FREE_DRAW = 0,
    ROUND_PHASE_WAITING_GUESS,
    ROUND_PHASE_RESULT_LOCKED,
    ROUND_PHASE_WAITING_PROMPT,
} RoundPhase_t;

/* =============================================================
 * SECTION 4 - Global Handles & Shared State
 * ============================================================= */

/* FreeRTOS synchronisation objects */
static QueueHandle_t      encoderQueue;     /* EncoderEvent_t   */
static QueueHandle_t      uartRecvQueue;    /* UartMessage_t    */
static SemaphoreHandle_t  penStateMutex;    /* protects penState */
static SemaphoreHandle_t  buttonSemaphore;  /* binary, from ISR */

/* Shared pen state - always access under penStateMutex */
static PenState_t penState = {
    .x       = CANVAS_CENTER_X,
    .y       = CANVAS_CENTER_Y,
    .penDown = 0,
    .erase   = 0,
    .submit  = 0,
    .promptRequest = 1,
    .eraseRetryFrames = 0
};
static volatile RoundPhase_t s_roundPhase = ROUND_PHASE_WAITING_PROMPT;

/* UART TX buffer - written by task, consumed by ISR */
static char          uartSendBuf[MAX_MSG_LEN];
static volatile int  uartSendIdx = 0;
static volatile uint32_t s_uartRecvQueueDrops = 0;
static volatile uint8_t s_i2cTimeoutSeen = 0;
static volatile uint8_t s_i2cNackSeen = 0;
static volatile uint16_t s_mpuRecoveryCount = 0;
static uint32_t s_passiveBuzzerCounterHz = 0;

#if ENABLE_INPUT_TELEMETRY
static InputTelemetry_t s_inputTelemetry;

static char telemetrySignS32(int32_t value)
{
    return (value < 0) ? '-' : '+';
}

static uint32_t telemetryAbsS32(int32_t value)
{
    return (value < 0) ? (uint32_t)(-value) : (uint32_t)value;
}

#endif

/* Buzzer mode - set by tasks, cleared by buzzer task */
typedef enum {
    BUZZ_NONE,
    BUZZ_BOUNDARY,     /* short beep - pen hit canvas edge */
    BUZZ_CORRECT,      /* happy tune - AI guessed correctly */
    BUZZ_WRONG         /* sad tone  - AI guessed wrong */
} BuzzerMode_t;
static volatile BuzzerMode_t buzzerMode = BUZZ_NONE;

/* =============================================================
 * SECTION 5 - Low-Level Initialisation
 * ============================================================= */

/* -- Clock gating for every port & peripheral we use -------- */
static void initClocks(void)
{
    SIM->SCGC5 |= SIM_SCGC5_PORTA_MASK
                |  SIM_SCGC5_PORTB_MASK
                |  SIM_SCGC5_PORTC_MASK
                |  SIM_SCGC5_PORTD_MASK
                |  SIM_SCGC5_PORTE_MASK;

    SIM->SCGC4 |= SIM_SCGC4_UART2_MASK
                |  SIM_SCGC4_I2C0_MASK;

    /* ADC0 is used for the joystick VRx channel (ADC0_SE8 on PTB0). */
    SIM->SCGC6 |= SIM_SCGC6_ADC0_MASK
                |  SIM_SCGC6_TPM0_MASK;
}

/* -- UART2 (same pattern as lab uart_rtos.c) ---------------- */
static void initUART2(uint32_t baud)
{
    NVIC_DisableIRQ(UART2_FLEXIO_IRQn);

    UART2->C2 &= ~(UART_C2_TE_MASK | UART_C2_RE_MASK);

    PORTE->PCR[UART_TX_PIN] = PORT_PCR_MUX(4);
    PORTE->PCR[UART_RX_PIN] = PORT_PCR_MUX(4);

