sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
    uint32_t busClk = CLOCK_GetBusClkFreq();
    uint32_t sbr    = (busClk + (baud * 8)) / (baud * 16);

    UART2->BDH &= ~UART_BDH_SBR_MASK;
    UART2->BDH |= (uint8_t)((sbr >> 8) & UART_BDH_SBR_MASK);
    UART2->BDL  = (uint8_t)(sbr & 0xFF);

    UART2->C1 = 0;                          /* 8-N-1, no loops */
    UART2->C2 |= UART_C2_RIE_MASK          /* RX interrupt on  */
              |  UART_C2_RE_MASK            /* receiver on      */
              |  UART_C2_TE_MASK;           /* transmitter on (kept enabled; ISR only toggles TIE) */

    NVIC_SetPriority(UART2_FLEXIO_IRQn, UART2_INT_PRIO);
    NVIC_ClearPendingIRQ(UART2_FLEXIO_IRQn);
    NVIC_EnableIRQ(UART2_FLEXIO_IRQn);
}

/* -- Rotary encoders  (CLK on PORTA w/ interrupt, DT on PORTC) */
static void initEncoders(void)
{
    /* CLK pins: PTA5, PTA13 - falling-edge interrupt, pull-up */
    PORTA->PCR[ENC1_CLK_PIN] = PORT_PCR_MUX(1)
                              | PORT_PCR_PE_MASK
                              | PORT_PCR_PS_MASK
                              | PORT_PCR_IRQC(0b1010);
    PORTA->PCR[ENC2_CLK_PIN] = PORT_PCR_MUX(1)
                              | PORT_PCR_PE_MASK
                              | PORT_PCR_PS_MASK
                              | PORT_PCR_IRQC(0b1010);

    GPIOA->PDDR &= ~((1 << ENC1_CLK_PIN) | (1 << ENC2_CLK_PIN));

    /* DT pins: PTC1, PTC2 - plain input, pull-up */
    PORTC->PCR[ENC1_DT_PIN] = PORT_PCR_MUX(1)
                             | PORT_PCR_PE_MASK
                             | PORT_PCR_PS_MASK;
    PORTC->PCR[ENC2_DT_PIN] = PORT_PCR_MUX(1)
                             | PORT_PCR_PE_MASK
                             | PORT_PCR_PS_MASK;

    GPIOC->PDDR &= ~((1 << ENC1_DT_PIN) | (1 << ENC2_DT_PIN));
}

/* -- External KY-004 button on PTA12 ------------------------ */
static void initButton(void)
{
    /* KY-004 has on-board pull-DOWN (R1 = 10k).
     * S = LOW normally, goes HIGH on press.
     * Use rising edge to detect press. */
    PORTA->PCR[BTN_PIN] &= ~PORT_PCR_MUX_MASK;
    PORTA->PCR[BTN_PIN] = PORT_PCR_MUX(1);

    GPIOA->PDDR &= ~(1 << BTN_PIN);

    PORTA->PCR[BTN_PIN] &= ~PORT_PCR_PS_MASK;
                                              /* PS=0 = pull-down */

    PORTA->PCR[BTN_PIN] &= ~PORT_PCR_PE_MASK;
    PORTA->PCR[BTN_PIN] |= PORT_PCR_PE(1);   /* pull enable */

    PORTA->PCR[BTN_PIN] &= ~PORT_PCR_IRQC_MASK;
    PORTA->PCR[BTN_PIN] |= PORT_PCR_IRQC(0b1001);/* rising edge */
}

/* -- Enable PORTA interrupt (shared by encoders + button) --- */
static void initPortAIRQ(void)
{
    NVIC_SetPriority(PORTA_IRQn, 64);
    NVIC_ClearPendingIRQ(PORTA_IRQn);
    NVIC_EnableIRQ(PORTA_IRQn);
}

/* -- Joystick VRx analog pin-mux (PTB0 = ADC0_SE8) ---------- */
/* MUX(0) on a Kinetis port selects the pin's analog alternative
 * (ADC). PDDR is irrelevant for analog function. No pull enable:
 * the joystick's internal 10 k pot already defines the voltage,
 * and adding PE/PS would load one side of the divider. */
static void initJoystickX(void)
{
    PORTB->PCR[JOY_X_PIN] = PORT_PCR_MUX(0);
}

/* -- ADC0: single-ended, 12-bit, software-triggered --------- */
/* CFG1 = bus_clk / 8, long sample, 12-bit, bus-clock source.
 * CFG2 = longest sample window (more settling time on the
 *        sample-and-hold cap → less sensitivity to source
 *        impedance; a 10 k pot is a high-impedance source).
 * SC2  = 0 : software trigger, no compare, no DMA.
 * SC3  = AVGE | AVGS(3) : hardware average of 32 samples per
 *        conversion. One readJoystickX() call therefore returns
 *        the mean of 32 sub-samples — the first debounce layer.
 * No write to SC1[0] here; that field starts the conversion
 * and is set each call in readJoystickX(). */
static void initJoystickAdc(void)
{
    ADC0->CFG1 = ADC_CFG1_ADIV(3)
               | ADC_CFG1_ADLSMP_MASK
               | ADC_CFG1_MODE(1)
               | ADC_CFG1_ADICLK(0);
    ADC0->CFG2 = ADC_CFG2_ADLSTS(0);
    ADC0->SC2  = 0U;
    ADC0->SC3  = ADC_SC3_AVGE_MASK
               | ADC_SC3_AVGS(3);
}

/* Blocking read of ADC0_SE8 (joystick VRx).
 * Writing ADCH != 0x1F starts a conversion; COCO in SC1[0]
 * signals completion. Spin-wait is bounded by hardware
 * conversion time (<~300 us with 32-sample averaging at
 * typical MCXC bus clocks), well under one FreeRTOS tick. */
static uint16_t readJoystickX(void)
{
    ADC0->SC1[0] = ADC_SC1_ADCH(JOY_ADC_CHANNEL);
    while ((ADC0->SC1[0] & ADC_SC1_COCO_MASK) == 0U) {
        /* spin */
    }
    return (uint16_t)ADC0->R[0];
}

/* -- SMD RGB LED (PTD4 / PTD2 / PTD6, GPIO output) --------- */
static void initRgbLed(void)
{
    PORTD->PCR[LED_R_PIN] = PORT_PCR_MUX(1);
    PORTD->PCR[LED_G_PIN] = PORT_PCR_MUX(1);
    PORTD->PCR[LED_B_PIN] = PORT_PCR_MUX(1);

    GPIOD->PDDR |= (1 << LED_R_PIN)
                 |  (1 << LED_G_PIN)
                 |  (1 << LED_B_PIN);

    /* Start OFF (common cathode: LOW = off) */
    GPIOD->PCOR = (1 << LED_R_PIN)
                | (1 << LED_G_PIN)
                | (1 << LED_B_PIN);
}

/* -- Buzzers (PTE20 active GPIO, PTE30 passive TPM PWM) ------ */
static void initPassiveBuzzerPwm(void)
{
    CLOCK_SetTpmClock(PASSIVE_BUZZER_TPM_CLK_SRC);

    s_passiveBuzzerCounterHz = CLOCK_GetFreq(kCLOCK_PllFllSelClk);
    if (s_passiveBuzzerCounterHz == 0U) {
        s_passiveBuzzerCounterHz = CLOCK_GetBusClkFreq();
    }
    s_passiveBuzzerCounterHz >>= PASSIVE_BUZZER_TPM_PRESCALE;
    if (s_passiveBuzzerCounterHz == 0U) {
        s_passiveBuzzerCounterHz = 1U;
    }

    PASSIVE_BUZZER_TPM->SC = 0U;
    PASSIVE_BUZZER_TPM->CNT = 0U;
    PASSIVE_BUZZER_TPM->MOD = 0xFFFFU;
    PASSIVE_BUZZER_TPM->CONTROLS[PASSIVE_BUZZER_TPM_CHANNEL].CnSC =
        TPM_CnSC_MSB_MASK | TPM_CnSC_ELSB_MASK;
    PASSIVE_BUZZER_TPM->CONTROLS[PASSIVE_BUZZER_TPM_CHANNEL].CnV = 0U;

    PASSIVE_BUZZER_TPM->SC = TPM_SC_PS(PASSIVE_BUZZER_TPM_PRESCALE)
                           | TPM_SC_CMOD(1U);
}

static void passiveBuzzerStartToneHz(uint32_t freqHz)
{
    if (freqHz == 0U) {
        return;
    }

