sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
    uint32_t periodCounts = (s_passiveBuzzerCounterHz + (freqHz / 2U)) / freqHz;
    if (periodCounts < 2U) {
        periodCounts = 2U;
    } else if (periodCounts > 65535U) {
        periodCounts = 65535U;
    }

    PASSIVE_BUZZER_TPM->MOD = (uint16_t)(periodCounts - 1U);
    PASSIVE_BUZZER_TPM->CONTROLS[PASSIVE_BUZZER_TPM_CHANNEL].CnV = (uint16_t)(periodCounts / 2U);
    PASSIVE_BUZZER_TPM->CNT = 0U;
}

static void passiveBuzzerStopTone(void)
{
    PASSIVE_BUZZER_TPM->CONTROLS[PASSIVE_BUZZER_TPM_CHANNEL].CnV = 0U;
    PASSIVE_BUZZER_TPM->CNT = 0U;
}

static void initBuzzers(void)
{
    PORTE->PCR[ACTIVE_BUZZER_PIN] = PORT_PCR_MUX(1);
    GPIOE->PDDR |= (1 << ACTIVE_BUZZER_PIN);
    GPIOE->PCOR = (1 << ACTIVE_BUZZER_PIN);

    /* Drive low as GPIO before switching the pin to TPM PWM output. */
    PORTE->PCR[PASSIVE_BUZZER_PIN] = PORT_PCR_MUX(1);
    GPIOE->PDDR |= (1 << PASSIVE_BUZZER_PIN);
    GPIOE->PCOR = (1 << PASSIVE_BUZZER_PIN);

    PORTE->PCR[PASSIVE_BUZZER_PIN] = PORT_PCR_MUX(3);
    initPassiveBuzzerPwm();
}

/* -- I2C0 for MPU-6050 (PTB2 SCL, PTB3 SDA) ---------------- */
static void initI2C0(void)
{
    PORTB->PCR[I2C_SCL_PIN] = PORT_PCR_MUX(2) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;
    PORTB->PCR[I2C_SDA_PIN] = PORT_PCR_MUX(2) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;

    I2C0->C1 = 0;

    /* I2C clock: MULT=2 (div 4), ICR=0x2F (div 960)
     * Bus clock ~24 MHz -> 24M / 4 / 960 = ~6.25 kHz
     * Very slow, but reliable with weak internal pull-ups.  */
    I2C0->F = I2C_F_ICR(0x2F) | I2C_F_MULT(2);

    I2C0->C1 |= I2C_C1_IICEN_MASK;
}

/* =============================================================
 * SECTION 6 - I2C Helpers (bare-metal, blocking)
 *
 * These are called ONLY from sensorPollTask, never from ISRs.
 * ============================================================= */

static uint8_t i2cBusyWait(void)
{
    uint32_t timeout = 200000;
    while (!(I2C0->S & I2C_S_IICIF_MASK) && --timeout)
        ;
    if (timeout == 0U) {
        s_i2cTimeoutSeen = 1U;
        return 0;
    }
    I2C0->S |= I2C_S_IICIF_MASK;              /* clear flag */
    return 1;
}

static void i2cStart(void)
{
    I2C0->C1 |= I2C_C1_TX_MASK;               /* transmit mode */
    I2C0->C1 |= I2C_C1_MST_MASK;              /* START         */
}

static void i2cStop(void)
{
    I2C0->C1 &= ~I2C_C1_MST_MASK;             /* STOP          */
    I2C0->C1 &= ~I2C_C1_TX_MASK;
}

static uint8_t i2cWriteByte(uint8_t data)
{
    I2C0->D = data;
    if (i2cBusyWait() == 0U) {
        return 0;
    }
    if ((I2C0->S & I2C_S_RXAK_MASK) != 0U) {
        s_i2cNackSeen = 1U;
        return 0;
    }
    return 1;
}

/* Burst-read N bytes starting at register 'startReg'.
 * Uses STOP+START like the proven single-byte helpers; repeated START was
 * unreliable on this wiring and can produce all-0xFF reads. */
static uint8_t mpuBurstRead(uint8_t startReg, uint8_t *buf, uint8_t n)
{
    if (n == 0) return 0;

    /* Use vTaskSuspendAll instead of taskENTER_CRITICAL so that
     * UART and other interrupts still fire during the I2C read. */
    vTaskSuspendAll();

    i2cStart();
    if (i2cWriteByte((uint8_t)(MPU6050_ADDR << 1)) == 0U ||
        i2cWriteByte(startReg) == 0U) {
        i2cStop();
        xTaskResumeAll();
        return 0;
    }
    i2cStop();

    for (volatile int d = 0; d < 1000; d++) ;

    i2cStart();
    if (i2cWriteByte((uint8_t)((MPU6050_ADDR << 1) | 1)) == 0U) {
        i2cStop();
        xTaskResumeAll();
        return 0;
    }

    I2C0->C1 &= ~I2C_C1_TX_MASK;                     /* RX mode  */

    if (n == 1) {
        I2C0->C1 |= I2C_C1_TXAK_MASK;                /* NACK     */
    } else {
        I2C0->C1 &= ~I2C_C1_TXAK_MASK;               /* ACK      */
    }

    (void)I2C0->D;                                    /* dummy read */
    if (i2cBusyWait() == 0U) {
        i2cStop();
        xTaskResumeAll();
        return 0;
    }

    for (uint8_t i = 0; i < n; i++) {
        if (i == n - 2) {
            /* Next-to-last byte: set NACK for the last read */
            I2C0->C1 |= I2C_C1_TXAK_MASK;
        }
        if (i == n - 1) {
            /* Last byte: issue STOP before reading */
            i2cStop();
        }
        buf[i] = I2C0->D;
        if (i < n - 1) {
            if (i2cBusyWait() == 0U) {
                i2cStop();
                xTaskResumeAll();
                return 0;
            }
        }
    }

    xTaskResumeAll();
    return 1;
}

/* Write a single register on MPU-6050.
 * Called during init (before scheduler) so no critical section needed. */
static void mpuWriteReg(uint8_t reg, uint8_t val)
{
    i2cStart();
    i2cWriteByte((uint8_t)(MPU6050_ADDR << 1));
    i2cWriteByte(reg);
    i2cWriteByte(val);
    i2cStop();
}

/* Single-byte read using STOP+START instead of RESTART.
 * The MPU-6050 latches the register pointer after the write phase,
 * so a separate read transaction works reliably even with weak pull-ups. */
static uint8_t mpuReadRegInit(uint8_t reg)
{
    /* Write phase: set the register pointer */
    i2cStart();
    i2cWriteByte((uint8_t)(MPU6050_ADDR << 1));
    i2cWriteByte(reg);
    i2cStop();

    /* Small delay for bus turnaround */
    for (volatile int d = 0; d < 1000; d++) ;

    /* Read phase: read one byte from the pointed register */
    i2cStart();
    i2cWriteByte((uint8_t)((MPU6050_ADDR << 1) | 1));

    I2C0->C1 &= ~I2C_C1_TX_MASK;
    I2C0->C1 |=  I2C_C1_TXAK_MASK;

    (void)I2C0->D;
    i2cBusyWait();

    i2cStop();
    return I2C0->D;
}

/* I2C bus recovery: bit-bang 9 SCL clocks to unstick a slave holding SDA LOW.
 * Temporarily switches pins to GPIO, toggles SCL, then restores I2C mux. */
static void i2cBusRecovery(uint8_t verbose)
{
    /* Disable I2C peripheral while we bit-bang */
    I2C0->C1 &= ~I2C_C1_IICEN_MASK;

    /* Switch SCL to GPIO output, SDA to GPIO input */
    PORTB->PCR[I2C_SCL_PIN] = PORT_PCR_MUX(1) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;
    PORTB->PCR[I2C_SDA_PIN] = PORT_PCR_MUX(1) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;
    GPIOB->PDDR |=  (1 << I2C_SCL_PIN);   /* SCL = output */
    GPIOB->PDDR &= ~(1 << I2C_SDA_PIN);   /* SDA = input  */

    if (verbose) {
        PRINTF("I2C recovery: toggling SCL...\r\n");
    }

