sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
    /* Toggle SCL up to 9 times; check SDA after each */
    for (int i = 0; i < 9; i++) {
        GPIOB->PCOR = (1 << I2C_SCL_PIN);            /* SCL LOW  */
        for (volatile int d = 0; d < 5000; d++) ;
        GPIOB->PSOR = (1 << I2C_SCL_PIN);            /* SCL HIGH */
        for (volatile int d = 0; d < 5000; d++) ;

        uint8_t sda = (GPIOB->PDIR >> I2C_SDA_PIN) & 1;
        if (verbose) {
            PRINTF("  clk %d: SDA=%d\r\n", i + 1, sda);
        }
        if (sda) {
            if (verbose) {
                PRINTF("  SDA released after %d clocks\r\n", i + 1);
            }
            break;
        }
    }

    /* Generate a STOP condition: SDA LOW -> SCL HIGH -> SDA HIGH */
    GPIOB->PDDR |= (1 << I2C_SDA_PIN);   /* SDA = output */
    GPIOB->PCOR = (1 << I2C_SDA_PIN);     /* SDA LOW  */
    for (volatile int d = 0; d < 5000; d++) ;
    GPIOB->PSOR = (1 << I2C_SCL_PIN);     /* SCL HIGH */
    for (volatile int d = 0; d < 5000; d++) ;
    GPIOB->PSOR = (1 << I2C_SDA_PIN);     /* SDA HIGH = STOP */
    for (volatile int d = 0; d < 5000; d++) ;

    /* Read final pin states */
    uint8_t scl = (GPIOB->PDIR >> I2C_SCL_PIN) & 1;
    uint8_t sda = (GPIOB->PDIR >> I2C_SDA_PIN) & 1;
    if (verbose) {
        PRINTF("  Final: SCL=%d SDA=%d\r\n", scl, sda);
    }

    /* Restore I2C mux */
    PORTB->PCR[I2C_SCL_PIN] = PORT_PCR_MUX(2) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;
    PORTB->PCR[I2C_SDA_PIN] = PORT_PCR_MUX(2) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;
    I2C0->C1 |= I2C_C1_IICEN_MASK;
}

static void initMPU6050(void)
{
    /* Small delay for MPU-6050/6500 power-on */
    for (volatile int i = 0; i < 500000; i++) ;

    /* Recover I2C bus in case it's stuck from a previous boot */
    i2cBusRecovery(1);

    /* Device reset (works for both MPU-6050 and MPU-6500) */
    mpuWriteReg(MPU6050_REG_PWR_MGMT_1, 0x80);
    /* MPU-6500 needs up to 100ms after reset */
    for (volatile int i = 0; i < 1000000; i++) ;

    /* Wake the sensor: write 0x01 (SLEEP=0, CLKSEL=auto-best).
     * Retry several times because I2C writes can fail with weak pull-ups. */
    uint8_t pwr = 0xFF;
    for (int attempt = 0; attempt < 10; attempt++) {
        mpuWriteReg(MPU6050_REG_PWR_MGMT_1, 0x01);
        for (volatile int i = 0; i < 200000; i++) ;
        pwr = mpuReadRegInit(0x6B);
        PRINTF("MPU wake attempt %d: PWR=0x%02X\r\n", attempt + 1, pwr);
        if ((pwr & 0x40) == 0) {   /* SLEEP bit (bit 6) cleared? */
            PRINTF("  -> Sensor awake!\r\n");
            break;
        }
    }

    /* Verify communication */
    uint8_t whoami = mpuReadRegInit(0x75);
    PRINTF("MPU WHO_AM_I=0x%02X (0x68=MPU6050, 0x70=MPU6500), PWR=0x%02X\r\n",
           whoami, pwr);

    s_i2cTimeoutSeen = 0U;
    s_i2cNackSeen = 0U;
}

/* Single-byte register read for use during runtime (scheduler running).
 * Uses STOP+START instead of RESTART for reliability with weak pull-ups. */
static uint8_t mpuReadRegRuntime(uint8_t reg)
{
    uint8_t val;
    vTaskSuspendAll();

    /* Write phase: set register pointer */
    i2cStart();
    i2cWriteByte((uint8_t)(MPU6050_ADDR << 1));
    i2cWriteByte(reg);
    i2cStop();

    for (volatile int d = 0; d < 1000; d++) ;

    /* Read phase */
    i2cStart();
    i2cWriteByte((uint8_t)((MPU6050_ADDR << 1) | 1));

    I2C0->C1 &= ~I2C_C1_TX_MASK;
    I2C0->C1 |=  I2C_C1_TXAK_MASK;

    (void)I2C0->D;
    i2cBusyWait();

    i2cStop();
    val = I2C0->D;

    xTaskResumeAll();
    return val;
}

/* Write a single register during runtime (scheduler running).
 * Uses STOP+START and suspends tasks like mpuReadRegRuntime. */
static void mpuWriteRegRuntime(uint8_t reg, uint8_t val)
{
    vTaskSuspendAll();
    i2cStart();
    i2cWriteByte((uint8_t)(MPU6050_ADDR << 1));
    i2cWriteByte(reg);
    i2cWriteByte(val);
    i2cStop();
    xTaskResumeAll();
}

static void mpuRuntimeRecover(uint8_t reasonCode)
{
    s_mpuRecoveryCount++;
    PRINTF("[SHAKE] recover #%u reason=%u\r\n",
           (unsigned)s_mpuRecoveryCount,
           (unsigned)reasonCode);

    i2cBusRecovery(0);
    initI2C0();
    mpuWriteRegRuntime(MPU6050_REG_PWR_MGMT_1, 0x01);
    for (volatile int i = 0; i < 200000; i++) ;

    uint8_t whoami = mpuReadRegRuntime(0x75);
    uint8_t pwr = mpuReadRegRuntime(MPU6050_REG_PWR_MGMT_1);
    PRINTF("[SHAKE] recover #%u done WHO=0x%02X PWR=0x%02X\r\n",
           (unsigned)s_mpuRecoveryCount,
           (unsigned)whoami,
           (unsigned)pwr);

    s_i2cTimeoutSeen = 0U;
    s_i2cNackSeen = 0U;
}

static void mpuResetShakeMotionState(ShakeMotionState_t *state)
{
    memset(state, 0, sizeof(*state));
}

static int16_t mpuReadAccelAxis(const uint8_t *buf, uint8_t offset)
{
    uint16_t raw = ((uint16_t)buf[offset] << 8) | (uint16_t)buf[offset + 1U];
    return (int16_t)raw;
}

static uint16_t mpuAbsDelta(int16_t current, int16_t previous)
{
    int32_t delta = (int32_t)current - (int32_t)previous;
    if (delta < 0) {
        delta = -delta;
    }
    return (uint16_t)delta;
}

static uint8_t mpuUpdateMotionWindow(ShakeMotionState_t *state, uint32_t score)
{
    uint8_t hot = (score >= SHAKE_SAMPLE_DELTA_THRESHOLD) ? 1U : 0U;

    if (state->sampleCount < SHAKE_MOTION_WINDOW_SAMPLES) {
        state->sampleCount++;
    } else {
        state->scoreSum -= state->scoreWindow[state->nextSampleIndex];
        state->hotSampleCount -= state->hotWindow[state->nextSampleIndex];
    }

    state->scoreWindow[state->nextSampleIndex] = score;
    state->hotWindow[state->nextSampleIndex] = hot;
    state->scoreSum += score;
    state->hotSampleCount += hot;

    state->nextSampleIndex++;
    if (state->nextSampleIndex >= SHAKE_MOTION_WINDOW_SAMPLES) {
        state->nextSampleIndex = 0;
    }

    if (state->sampleCount < SHAKE_MOTION_WINDOW_SAMPLES) {
        return 0;
    }

    return (state->hotSampleCount >= SHAKE_REQUIRED_HOT_SAMPLES &&
            state->scoreSum >= SHAKE_ENERGY_THRESHOLD) ? 1U : 0U;
}

/* Returns 1 when short-window acceleration energy indicates a shake. */
static uint8_t mpuDetectShake(void)
{
    static ShakeMotionState_t motionState;
    static int16_t prev_ax = 0, prev_ay = 0, prev_az = 0;
    static uint8_t first = 1;
    static uint8_t staleCount = 0;
    static TickType_t lastTriggerTick = 0;
    static uint8_t lockoutActive = 0;
    const TickType_t lockoutTicks = pdMS_TO_TICKS(SHAKE_TRIGGER_LOCKOUT_MS);

    uint8_t accelBuf[6];
    if (mpuBurstRead(MPU6050_REG_ACCEL_XOUT_H, accelBuf, sizeof(accelBuf)) == 0U) {
        uint8_t reason = (s_i2cTimeoutSeen != 0U) ? SHAKE_RECOVER_REASON_I2C_TIMEOUT
                                                  : SHAKE_RECOVER_REASON_I2C_NACK;
        mpuRuntimeRecover(reason);
        staleCount = 0;
        first = 1;
#if ENABLE_INPUT_TELEMETRY
        s_inputTelemetry.i2cErrorSeen = reason;
        s_inputTelemetry.staleCount = 0;
        s_inputTelemetry.recoveryCount = s_mpuRecoveryCount;
#endif
        return 0;
    }

