sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
    int16_t ax = mpuReadAccelAxis(accelBuf, 0U);
    int16_t ay = mpuReadAccelAxis(accelBuf, 2U);
    int16_t az = mpuReadAccelAxis(accelBuf, 4U);

#if ENABLE_INPUT_TELEMETRY
    s_inputTelemetry.accelX = ax;
    s_inputTelemetry.accelY = ay;
    s_inputTelemetry.accelZ = az;
    s_inputTelemetry.deltaX = 0;
    s_inputTelemetry.deltaY = 0;
    s_inputTelemetry.deltaZ = 0;
    s_inputTelemetry.motionScore = 0;
    s_inputTelemetry.motionEnergy = motionState.scoreSum;
    s_inputTelemetry.motionHotCount = motionState.hotSampleCount;
    s_inputTelemetry.shakeDetected = 0;
    s_inputTelemetry.staleCount = staleCount;
    s_inputTelemetry.recoveryCount = s_mpuRecoveryCount;
    s_inputTelemetry.i2cErrorSeen = (s_i2cTimeoutSeen != 0U) ? SHAKE_RECOVER_REASON_I2C_TIMEOUT :
                                    (s_i2cNackSeen != 0U) ? SHAKE_RECOVER_REASON_I2C_NACK : 0U;
#endif

    if (s_i2cTimeoutSeen != 0U || s_i2cNackSeen != 0U) {
        uint8_t reason = (s_i2cTimeoutSeen != 0U) ? SHAKE_RECOVER_REASON_I2C_TIMEOUT
                                                  : SHAKE_RECOVER_REASON_I2C_NACK;
        mpuRuntimeRecover(reason);
        staleCount = 0;
        first = 1;
#if ENABLE_INPUT_TELEMETRY
        s_inputTelemetry.staleCount = 0;
        s_inputTelemetry.recoveryCount = s_mpuRecoveryCount;
        s_inputTelemetry.i2cErrorSeen = 0;
#endif
        return 0;
    }

    if (first) {
        mpuResetShakeMotionState(&motionState);
        lockoutActive = 0;
        prev_ax = ax; prev_ay = ay; prev_az = az;
        first = 0;
#if ENABLE_INPUT_TELEMETRY
        s_inputTelemetry.motionEnergy = 0;
        s_inputTelemetry.motionHotCount = 0;
        s_inputTelemetry.lockoutActive = 0;
        s_inputTelemetry.lockoutMsRemaining = 0;
        s_inputTelemetry.staleCount = 0;
        s_inputTelemetry.recoveryCount = s_mpuRecoveryCount;
        s_inputTelemetry.i2cErrorSeen = 0;
#endif
        return 0;
    }

    /* Full-resolution stationary readings should not repeat exactly for long.
     * Exact repeated triples are treated as a likely latched I2C read. */
    if ((ax == prev_ax) && (ay == prev_ay) && (az == prev_az)) {
        staleCount++;
        if (staleCount >= SHAKE_STALE_READ_LIMIT) {
            PRINTF("[SHAKE] stale triple (%d,%d,%d) count=%u\r\n",
                   (int)ax,
                   (int)ay,
                   (int)az,
                   (unsigned)staleCount);
            mpuRuntimeRecover(SHAKE_RECOVER_REASON_STALE);
            staleCount = 0;
            first = 1;
#if ENABLE_INPUT_TELEMETRY
            s_inputTelemetry.staleCount = 0;
            s_inputTelemetry.recoveryCount = s_mpuRecoveryCount;
#endif
            return 0;
        }
    } else {
        staleCount = 0;
    }

    uint16_t deltaX = mpuAbsDelta(ax, prev_ax);
    uint16_t deltaY = mpuAbsDelta(ay, prev_ay);
    uint16_t deltaZ = mpuAbsDelta(az, prev_az);
    uint32_t motionScore = (uint32_t)deltaX + (uint32_t)deltaY + (uint32_t)deltaZ;
    uint8_t motionDetected = mpuUpdateMotionWindow(&motionState, motionScore);
    TickType_t now = xTaskGetTickCount();

    prev_ax = ax; prev_ay = ay; prev_az = az;

#if ENABLE_INPUT_TELEMETRY
    s_inputTelemetry.deltaX = deltaX;
    s_inputTelemetry.deltaY = deltaY;
    s_inputTelemetry.deltaZ = deltaZ;
    s_inputTelemetry.motionScore = motionScore;
    s_inputTelemetry.motionEnergy = motionState.scoreSum;
    s_inputTelemetry.motionHotCount = motionState.hotSampleCount;
    s_inputTelemetry.lockoutActive = 0;
    s_inputTelemetry.lockoutMsRemaining = 0;
    s_inputTelemetry.staleCount = staleCount;
    s_inputTelemetry.recoveryCount = s_mpuRecoveryCount;
    s_inputTelemetry.i2cErrorSeen = (s_i2cTimeoutSeen != 0U) ? SHAKE_RECOVER_REASON_I2C_TIMEOUT :
                                    (s_i2cNackSeen != 0U) ? SHAKE_RECOVER_REASON_I2C_NACK : 0U;
#endif

    if (lockoutActive) {
        TickType_t elapsed = now - lastTriggerTick;
        if (elapsed < lockoutTicks) {
#if ENABLE_INPUT_TELEMETRY
            s_inputTelemetry.lockoutActive = 1;
            s_inputTelemetry.lockoutMsRemaining = (uint16_t)((lockoutTicks - elapsed) * portTICK_PERIOD_MS);
#endif
            return 0;
        }
        lockoutActive = 0;
    }

    if (motionDetected) {
        lastTriggerTick = now;
        lockoutActive = 1;
        mpuResetShakeMotionState(&motionState);
#if ENABLE_INPUT_TELEMETRY
        s_inputTelemetry.lockoutActive = 1;
        s_inputTelemetry.lockoutMsRemaining = SHAKE_TRIGGER_LOCKOUT_MS;
        s_inputTelemetry.shakeDetected = 1;
#endif
        return 1;
    }

    return 0;
}

/* =============================================================
 * SECTION 7 - Actuator Helpers
 * ============================================================= */

/* -- RGB LED ------------------------------------------------ */
static void setLedColor(LedColor_t color)
{
    /*
     * Common-cathode: HIGH turns the channel ON.
     * If your LED is common-anode, swap the PSOR/PCOR lines
     * (set = off, clear = on).
     */
    uint8_t r = 0, g = 0, b = 0;

    switch (color) {
    case LED_RED:    r = 1;              break;
    case LED_GREEN:           g = 1;     break;
    case LED_BLUE:                  b=1; break;
    case LED_PURPLE: r = 1;         b=1; break;
    case LED_ORANGE: r = 1;  g = 1;      break;
    case LED_WHITE:  r = 1;  g = 1; b=1;break;
    default: break;
    }

    if (r) GPIOD->PSOR = (1 << LED_R_PIN);
    else   GPIOD->PCOR = (1 << LED_R_PIN);
    if (g) GPIOD->PSOR = (1 << LED_G_PIN);
    else   GPIOD->PCOR = (1 << LED_G_PIN);
    if (b) GPIOD->PSOR = (1 << LED_B_PIN);
    else   GPIOD->PCOR = (1 << LED_B_PIN);
}

/* =============================================================
 * SECTION 8 - UART Transmit Helper
 *
 * Copies string into the ISR-consumed send buffer, then
 * enables TIE + TE so the ISR drains it char-by-char.
 * ============================================================= */

static void uartSendMessage(const char *msg)
{
    /* Wait until the previous transmission is done.
     * (TIE is cleared by the ISR when it reaches '\0'.) */
    while (UART2->C2 & UART_C2_TIE_MASK)
        ;

    strncpy(uartSendBuf, msg, MAX_MSG_LEN - 1);
    uartSendBuf[MAX_MSG_LEN - 1] = '\0';
    uartSendIdx = 0;

    UART2->C2 |= UART_C2_TIE_MASK;
    UART2->C2 |= UART_C2_TE_MASK;
}

/* =============================================================
 * SECTION 9 - Interrupt Service Routines
 *
 * Rules followed:
 *   * No blocking calls (PRINTF, vTaskDelay, xQueueSend, etc.)
 *   * Use only ...FromISR() FreeRTOS API
 *   * Keep as short as possible
 * ============================================================= */

/* -- PORTA: encoder CLK edges + button press ---------------- */
void PORTA_IRQHandler(void)
{
    BaseType_t hpw = pdFALSE;
    uint32_t   isfr = PORTA->ISFR;

    /* ISR-level debounce using tick count.
     * Reject edges that arrive within 20ms of the last accepted
     * edge on the same encoder. This prevents bounce and
     * double-count from detent settle. */
    static TickType_t lastEnc1 = 0;
    static TickType_t lastEnc2 = 0;
    TickType_t now = xTaskGetTickCountFromISR();
    const TickType_t debounce = pdMS_TO_TICKS(20);

