sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
    /* --- Encoder 1 (PTA5 CLK) --------------------------------
     * On falling edge of CLK, read DT (PTC1) to find direction.
     * Also verify CLK is actually LOW (not a bounce back to HIGH). */
    if (isfr & (1 << ENC1_CLK_PIN)) {
        uint8_t clk = (GPIOA->PDIR >> ENC1_CLK_PIN) & 1u;
        if (!clk && (now - lastEnc1) >= debounce) {
            EncoderEvent_t evt;
            uint8_t dt = (GPIOC->PDIR >> ENC1_DT_PIN) & 1u;
            evt.axis  = 0;
            evt.delta = dt ? +1 : -1;
            xQueueSendFromISR(encoderQueue, &evt, &hpw);
            lastEnc1 = now;
        }
    }

    /* --- Encoder 2 (PTA13 CLK) ------------------------------- */
    if (isfr & (1 << ENC2_CLK_PIN)) {
        uint8_t clk = (GPIOA->PDIR >> ENC2_CLK_PIN) & 1u;
        if (!clk && (now - lastEnc2) >= debounce) {
            EncoderEvent_t evt;
            uint8_t dt = (GPIOC->PDIR >> ENC2_DT_PIN) & 1u;
            evt.axis  = 1;
            evt.delta = dt ? +1 : -1;
            xQueueSendFromISR(encoderQueue, &evt, &hpw);
            lastEnc2 = now;
        }
    }

    /* --- Button (PTA12) -------------------------------------- */
    if (isfr & (1 << BTN_PIN)) {
        xSemaphoreGiveFromISR(buttonSemaphore, &hpw);
    }

    /* Clear all PORTA flags at once */
    PORTA->ISFR = isfr;
    portYIELD_FROM_ISR(hpw);
}

/* -- UART2 TX / RX ------------------------------------------ */
void UART2_FLEXIO_IRQHandler(void)
{
    static char recvBuf[MAX_MSG_LEN];
    static int  recvIdx = 0;
    BaseType_t  hpw = pdFALSE;

    /* ---- TX: send next character ----------------------------- */
    if ((UART2->C2 & UART_C2_TIE_MASK) &&
        (UART2->S1 & UART_S1_TDRE_MASK))
    {
        if (uartSendBuf[uartSendIdx] == '\0') {
            /* Last byte has already been handed to the shifter; just stop
             * asking for more TX interrupts. TE stays enabled so the shifter
             * is allowed to finish clocking the final character out on the
             * wire — clearing TE here would truncate it. */
            uartSendIdx = 0;
            UART2->C2 &= ~UART_C2_TIE_MASK;  /* stop TX IRQ   */
        } else {
            UART2->D = uartSendBuf[uartSendIdx++];
        }
    }

    /* ---- RX: accumulate until '\n', then enqueue ------------ */
    if (UART2->S1 & UART_S1_RDRF_MASK) {
        char ch = UART2->D;
        if (recvIdx < MAX_MSG_LEN - 1) {
            recvBuf[recvIdx++] = ch;
        }
        if (ch == '\n') {
            UartMessage_t msg;
            recvBuf[recvIdx] = '\0';
            strncpy(msg.message, recvBuf, MAX_MSG_LEN);
            if (xQueueSendFromISR(uartRecvQueue, &msg, &hpw) != pdPASS) {
                s_uartRecvQueueDrops++;
            }
            recvIdx = 0;
        }
    }

    portYIELD_FROM_ISR(hpw);
}

/* =============================================================
 * SECTION 10 - FreeRTOS Tasks
 *
 * Task                    Priority  Blocks on
 * --------------------    --------  ----------------------
 * encoderProcessTask      3 (high)  encoderQueue
 * buttonTask              3 (high)  buttonSemaphore
 * sensorPollTask          2 (med)   vTaskDelayUntil
 * uartSendTask            2 (med)   vTaskDelayUntil
 * uartRecvTask            2 (med)   uartRecvQueue
 * buzzerTask              1 (low)   vTaskDelay
 *
 * With configUSE_TIME_SLICING = 1, the three priority-2 tasks
 * share the CPU in round-robin when no higher-priority task
 * is ready.
 * ============================================================= */

/*
 * encoderProcessTask - reads encoder deltas from the queue,
 * updates pen position, clamps to canvas, triggers buzzer.
 */
static void encoderProcessTask(void *pvParam)
{
    (void)pvParam;
    EncoderEvent_t evt;

    while (1) {
        if (xQueueReceive(encoderQueue, &evt,
                          portMAX_DELAY) == pdTRUE)
        {
            if (xSemaphoreTake(penStateMutex,
                               portMAX_DELAY) == pdTRUE)
            {
                uint8_t hitEdge = 0;

                if (s_roundPhase != ROUND_PHASE_FREE_DRAW) {
                    xSemaphoreGive(penStateMutex);
                    continue;
                }

                if (evt.axis == 0) {
                    int16_t nx = penState.x + evt.delta;
                    if (nx < 0)                { nx = 0;                hitEdge = 1; }
                    if (nx >= CANVAS_WIDTH)     { nx = CANVAS_WIDTH-1;  hitEdge = 1; }
                    penState.x = nx;
                } else {
                    int16_t ny = penState.y + evt.delta;
                    if (ny < 0)                { ny = 0;                hitEdge = 1; }
                    if (ny >= CANVAS_HEIGHT)    { ny = CANVAS_HEIGHT-1; hitEdge = 1; }
                    penState.y = ny;
                }

                PRINTF("ENC: x=%d y=%d\r\n", penState.x, penState.y);

                if (hitEdge) {
                    buzzerMode = BUZZ_BOUNDARY;
                }

                xSemaphoreGive(penStateMutex);
            }
        }
    }
}

/*
 * buttonTask - toggles pen up/down on each press, with
 * simple software debounce.
 */
static void buttonTask(void *pvParam)
{
    (void)pvParam;
    TickType_t lastPress = 0;

    while (1) {
        if (xSemaphoreTake(buttonSemaphore,
                           portMAX_DELAY) == pdTRUE)
        {
            TickType_t now = xTaskGetTickCount();
            if ((now - lastPress) > pdMS_TO_TICKS(DEBOUNCE_MS)) {
                if (xSemaphoreTake(penStateMutex,
                                   pdMS_TO_TICKS(10)) == pdTRUE)
                {
                    if (s_roundPhase != ROUND_PHASE_FREE_DRAW) {
                        xSemaphoreGive(penStateMutex);
                        lastPress = now;
                        continue;
                    }

                    penState.penDown = !penState.penDown;
                    setLedColor(penState.penDown ? LED_BLUE
                                                 : LED_PURPLE);
                    PRINTF("BTN: penDown=%d\r\n", penState.penDown);
                    xSemaphoreGive(penStateMutex);
                }
                lastPress = now;
            }
        }
    }
}

