sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
/*
 * sensorPollTask - periodically reads joystick VRx (ADC) and
 * MPU-6050 accelerometer.
 *
 * Joystick semantics: "active" = tilt toward X=0 (low voltage).
 *   - Hardware averaging (32 samples) inside readJoystickX()
 *     smooths the raw ADC reading; software-side debounce is
 *     therefore not needed.
 *   - Fire on the first poll where vrx < LOW_THRESH and the
 *     trigger is armed. Trigger latency is one poll (~50 ms).
 *   - Disarm immediately after firing; holding the stick down
 *     does not re-fire.
 *   - Re-arm when vrx climbs back above REARM_THRESH. REARM is
 *     set low enough that any stick release, even a sloppy
 *     breadboard one, clears the arm gate.
 *
 * The downstream rising-edge contract is preserved: touchRising
 * is set on exactly the poll that registers a fresh push, and
 * the round-phase logic below treats it identically to the
 * previous digital touch sensor.
 */
static void sensorPollTask(void *pvParam)
{
    (void)pvParam;
    TickType_t lastWake = xTaskGetTickCount();
    uint8_t gyroPollCount = 0;
    uint8_t joyArmed = 1;
#if ENABLE_INPUT_TELEMETRY
    TickType_t lastTelemetryTick = xTaskGetTickCount();
#endif

    while (1) {
        /* -- Joystick VRx (ADC read, every SENSOR_POLL_MS) --- */
        uint16_t vrx = readJoystickX();
        uint8_t touchRising = 0;

        if (joyArmed && vrx < JOY_X_LOW_THRESH) {
            touchRising = 1;
            joyArmed = 0;
        } else if (!joyArmed && vrx >= JOY_X_REARM_THRESH) {
            joyArmed = 1;
        }

        uint8_t shakeDetected = 0;

        /* -- Gyro/accel (I2C, polled at GYRO_POLL_DIVIDER cadence) -- */
#if ENABLE_GYRO
        gyroPollCount++;
        if (gyroPollCount >= GYRO_POLL_DIVIDER) {
            gyroPollCount = 0;
            if (mpuDetectShake()) {
                shakeDetected = 1;
            }
        }
#endif

        /* -- Take mutex only to update penState (fast) ------- */
        if (xSemaphoreTake(penStateMutex,
                           portMAX_DELAY) == pdTRUE)
        {
            if (touchRising) {
                if (s_roundPhase == ROUND_PHASE_FREE_DRAW) {
                    penState.submit = 1;
                    s_roundPhase = ROUND_PHASE_WAITING_GUESS;
                    /* Waiting for guess should pulse white; steady white is temporary. */
                    setLedColor(LED_WHITE);
                    PRINTF("TOUCH: submit (waiting guess)\r\n");
                } else if (s_roundPhase == ROUND_PHASE_RESULT_LOCKED) {
                    penState.promptRequest = 1;
                    penState.x = CANVAS_CENTER_X;
                    penState.y = CANVAS_CENTER_Y;
                    penState.penDown = 1;
                    s_roundPhase = ROUND_PHASE_WAITING_PROMPT;
                    setLedColor(LED_ORANGE);
                    PRINTF("TOUCH: request prompt\r\n");
                } else if (s_roundPhase == ROUND_PHASE_WAITING_PROMPT) {
                    penState.promptRequest = 1;
                    setLedColor(LED_ORANGE);
                    PRINTF("TOUCH: still waiting prompt\r\n");
                }
            }

            if (shakeDetected && s_roundPhase == ROUND_PHASE_FREE_DRAW) {
                penState.erase = 1;
                penState.eraseRetryFrames = ERASE_RETRY_FRAMES;
                PRINTF("SHAKE: erase\r\n");
            }
            xSemaphoreGive(penStateMutex);
        }

#if ENABLE_INPUT_TELEMETRY
        TickType_t nowTick = xTaskGetTickCount();
        if ((nowTick - lastTelemetryTick) >= pdMS_TO_TICKS(INPUT_TELEMETRY_PERIOD_MS)) {
         int32_t rawX = (int32_t)s_inputTelemetry.accelX;
         int32_t rawY = (int32_t)s_inputTelemetry.accelY;
         int32_t rawZ = (int32_t)s_inputTelemetry.accelZ;

             PRINTF("[SHAKE] a=%c%u,%c%u,%c%u d=%u,%u,%u s=%u e=%u hot=%u hit=%u err=%u rec=%u\r\n",
                   telemetrySignS32(rawX),
                   (unsigned)telemetryAbsS32(rawX),
                   telemetrySignS32(rawY),
                   (unsigned)telemetryAbsS32(rawY),
                   telemetrySignS32(rawZ),
                   (unsigned)telemetryAbsS32(rawZ),
                   (unsigned)s_inputTelemetry.deltaX,
                   (unsigned)s_inputTelemetry.deltaY,
                   (unsigned)s_inputTelemetry.deltaZ,
                   (unsigned)s_inputTelemetry.motionScore,
                   (unsigned)s_inputTelemetry.motionEnergy,
                   (unsigned)s_inputTelemetry.motionHotCount,
                   (unsigned)s_inputTelemetry.shakeDetected,
                   (unsigned)s_inputTelemetry.i2cErrorSeen,
                   (unsigned)s_inputTelemetry.recoveryCount);

            lastTelemetryTick = nowTick;
        }
#endif

        vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(SENSOR_POLL_MS));
    }
}

/*
 * uartSendTask - packs current pen state into a protocol
 * string and transmits to ESP32 over UART2.
 *
 * Packet format:  $S,x,y,penDown,erase,submit,promptRequest\n
 * Example:        $S,32,17,1,0,0,0\n
 */
static void uartSendTask(void *pvParam)
{
    (void)pvParam;
    TickType_t lastWake = xTaskGetTickCount();
    char buf[MAX_MSG_LEN];

    while (1) {
        if (xSemaphoreTake(penStateMutex,
                           pdMS_TO_TICKS(10)) == pdTRUE)
        {
            snprintf(buf, sizeof(buf), "$S,%d,%d,%d,%d,%d,%d\n",
                     penState.x,
                     penState.y,
                     penState.penDown,
                     penState.erase,
                     penState.submit,
                     penState.promptRequest);

            /* Erase retries briefly until ACK; submit/prompt stay asserted until RESULT/PROMPT. */
            if (penState.eraseRetryFrames > 0) {
                penState.eraseRetryFrames--;
                if (penState.eraseRetryFrames == 0) {
                    penState.erase = 0;
                }
            } else {
                penState.erase = 0;
            }

            xSemaphoreGive(penStateMutex);

            uartSendMessage(buf);
        }

        vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(UART_SEND_MS));
    }
}

