sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
/*
 * uartRecvTask - receives command packets from ESP32
 * and drives actuators accordingly.
 *
 * Expected packets from ESP32:
 *   $C,RESULT,<0|1>\n -> AI result (0=wrong, 1=correct)
 *   $C,PROMPT,1\n     -> new prompt is ready; unlock drawing
 *   $C,ACK,0\n        -> erase accepted; clear erase retry
 */
static void uartRecvTask(void *pvParam)
{
    (void)pvParam;
    UartMessage_t msg;
    uint32_t reportedDropCount = 0;

    while (1) {
        if (xQueueReceive(uartRecvQueue, &msg,
                          portMAX_DELAY) == pdTRUE)
        {
            uint32_t dropCount = s_uartRecvQueueDrops;
            if (dropCount != reportedDropCount) {
                uint32_t newDrops = dropCount - reportedDropCount;
                reportedDropCount = dropCount;
                PRINTF("[RX] UART receive queue full, dropped %u message(s)\r\n",
                       (unsigned)newDrops);
            }

            char cmd[16] = {0};
            int  val     = 0;

            if (sscanf(msg.message, "$C,%15[^,],%d", cmd, &val) >= 1) {
                if (xSemaphoreTake(penStateMutex, pdMS_TO_TICKS(10)) != pdTRUE) {
                    continue;
                }

                if (strcmp(cmd, "RESULT") == 0) {
                    penState.submit = 0;
                    s_roundPhase = ROUND_PHASE_RESULT_LOCKED;
                    if (val >= 1) {
                        setLedColor(LED_GREEN);
                        buzzerMode = BUZZ_CORRECT;
                        PRINTF("[RX] RESULT=1 (correct)\r\n");
                    } else {
                        setLedColor(LED_RED);
                        buzzerMode = BUZZ_WRONG;
                        PRINTF("[RX] RESULT=0 (wrong)\r\n");
                    }

                } else if (strcmp(cmd, "PROMPT") == 0 && val >= 1) {
                    penState.x = CANVAS_CENTER_X;
                    penState.y = CANVAS_CENTER_Y;
                    penState.penDown = 1;
                    penState.erase = 0;
                    penState.eraseRetryFrames = 0;
                    penState.submit = 0;
                    penState.promptRequest = 0;
                    s_roundPhase = ROUND_PHASE_FREE_DRAW;
                    setLedColor(LED_BLUE);
                    PRINTF("[RX] PROMPT=1 (center + unlock)\r\n");

                } else if (strcmp(cmd, "ACK") == 0) {
                    penState.erase = 0;
                    penState.eraseRetryFrames = 0;
                }

                xSemaphoreGive(penStateMutex);
            }
        }
    }
}

/*
 * buzzerTask - handles two separate buzzers:
 *   Active buzzer (PTE20):  boundary beep - just pulse HIGH/LOW
 *   Passive buzzer (PTE30): result tunes - square wave for tones
 *
 * Runs at lowest priority so it never starves real work.
 */

/* Play a tone on the passive buzzer using TPM PWM carrier generation.
 * Note duration stays in task context via vTaskDelay(). */
static void playTone(uint32_t halfPeriodUs, uint32_t durationMs)
{
    if (halfPeriodUs == 0U || durationMs == 0U) {
        passiveBuzzerStopTone();
        return;
    }

    uint32_t freqHz = 500000U / halfPeriodUs;
    TickType_t toneTicks = pdMS_TO_TICKS(durationMs);

    if (freqHz == 0U) {
        freqHz = 1U;
    }
    if (toneTicks == 0U) {
        toneTicks = 1U;
    }

    passiveBuzzerStartToneHz(freqHz);
    vTaskDelay(toneTicks);
    passiveBuzzerStopTone();
}

static void buzzerTask(void *pvParam)
{
    (void)pvParam;

    while (1) {
        BuzzerMode_t mode = buzzerMode;

        if (mode == BUZZ_BOUNDARY) {
            /* Active buzzer: just pulse HIGH for 50ms then LOW */
            GPIOE->PSOR = (1 << ACTIVE_BUZZER_PIN);
            vTaskDelay(pdMS_TO_TICKS(50));
            GPIOE->PCOR = (1 << ACTIVE_BUZZER_PIN);
            buzzerMode = BUZZ_NONE;

        } else if (mode == BUZZ_CORRECT) {
            /* Happy victory tune - 6 ascending notes
             * halfPeriodUs values for approximate notes:
             *   C5=956  D5=851  E5=758  G5=637  A5=568  C6=478 */
            playTone(956, 100);   /* C5 */
            playTone(758, 100);   /* E5 */
            playTone(637, 100);   /* G5 */
            playTone(568, 100);   /* A5 */
            playTone(478, 150);   /* C6 */
            vTaskDelay(pdMS_TO_TICKS(30));
            playTone(478, 300);   /* C6 (hold) */
            buzzerMode = BUZZ_NONE;

        } else if (mode == BUZZ_WRONG) {
            /* Sad descending tune - 4 notes */
            playTone(568, 150);   /* A5 */
            playTone(637, 150);   /* G5 */
            playTone(758, 200);   /* E5 */
            vTaskDelay(pdMS_TO_TICKS(50));
            playTone(956, 400);   /* C5 (long hold) */
            buzzerMode = BUZZ_NONE;

        } else {
            vTaskDelay(pdMS_TO_TICKS(20));  /* idle poll */
        }
    }
}

/* =============================================================
 * SECTION 11 - main()
 * ============================================================= */

int main(void)
{
    /* -- Board-level init (generated by MCUXpresso) ---------- */

	BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    BOARD_InitDebugConsole();
#endif


    /* -- Create FreeRTOS objects FIRST -----------------------
     * Must exist before any ISR that uses them is enabled.   */
    encoderQueue    = xQueueCreate(QUEUE_LEN, sizeof(EncoderEvent_t));
    uartRecvQueue   = xQueueCreate(QUEUE_LEN, sizeof(UartMessage_t));
    penStateMutex   = xSemaphoreCreateMutex();
    buttonSemaphore = xSemaphoreCreateBinary();

    if (!encoderQueue || !uartRecvQueue ||
        !penStateMutex || !buttonSemaphore)
    {
        PRINTF("FATAL: could not create RTOS objects\r\n");
        while (1) ;
    }

    PRINTF("=== Drawing App MCU - Starting ===\r\n");

    /* -- Peripheral init (safe now - RTOS objects exist) ---- */
    initClocks();
    initUART2(BAUD_RATE);
    initEncoders();
    initButton();
    initPortAIRQ();
    initJoystickX();
    initJoystickAdc();
    initRgbLed();
    initBuzzers();

