sean6369/etch-a-sketch-mcxc/source/MCXC444_Project.c
    /* -- Quick buzzer test (remove after testing) ------------- */
    PRINTF("Passive buzzer test (PTE30 PWM)...\r\n");
    passiveBuzzerStartToneHz(523U);
    for (volatile int d = 0; d < 2000000; d++) ;
    passiveBuzzerStopTone();
    PRINTF("Active buzzer test (PTE20)...\r\n");
    GPIOE->PSOR = (1 << ACTIVE_BUZZER_PIN);
    for (volatile int d = 0; d < 2000000; d++) ;
    GPIOE->PCOR = (1 << ACTIVE_BUZZER_PIN);
    PRINTF("Buzzer tests done\r\n");

    /* -- Quick LED test (remove after testing) ---------------- */
    PRINTF("LED test: RED...\r\n");
    setLedColor(LED_RED);
    for (volatile int d = 0; d < 2000000; d++) ;
    PRINTF("LED test: GREEN...\r\n");
    setLedColor(LED_GREEN);
    for (volatile int d = 0; d < 2000000; d++) ;
    PRINTF("LED test: BLUE...\r\n");
    setLedColor(LED_BLUE);
    for (volatile int d = 0; d < 2000000; d++) ;
    PRINTF("LED test: PURPLE...\r\n");
    setLedColor(LED_PURPLE);
    for (volatile int d = 0; d < 2000000; d++) ;
    PRINTF("LED test: ORANGE...\r\n");
    setLedColor(LED_ORANGE);
    for (volatile int d = 0; d < 2000000; d++) ;
    PRINTF("LED test: WHITE...\r\n");
    setLedColor(LED_WHITE);
    for (volatile int d = 0; d < 2000000; d++) ;
    setLedColor(LED_OFF);
    PRINTF("LED tests done\r\n");

#if ENABLE_GYRO
    initI2C0();
    initMPU6050();
#endif

    PRINTF("Peripherals OK\r\n");

    /* -- Create tasks --------------------------------------- */
    xTaskCreate(encoderProcessTask, "enc",
                configMINIMAL_STACK_SIZE + 100, NULL, 3, NULL);
    xTaskCreate(buttonTask,         "btn",
                configMINIMAL_STACK_SIZE + 100, NULL, 3, NULL);
    xTaskCreate(sensorPollTask,     "sensor",
                configMINIMAL_STACK_SIZE + 200, NULL, 2, NULL);
    xTaskCreate(uartSendTask,       "tx",
                configMINIMAL_STACK_SIZE + 200, NULL, 2, NULL);
    xTaskCreate(uartRecvTask,       "rx",
                configMINIMAL_STACK_SIZE + 200, NULL, 2, NULL);
    xTaskCreate(buzzerTask,         "buzz",
                configMINIMAL_STACK_SIZE + 100, NULL, 1, NULL);

    if (xSemaphoreTake(penStateMutex, portMAX_DELAY) == pdTRUE) {
        penState.x = CANVAS_CENTER_X;
        penState.y = CANVAS_CENTER_Y;
        penState.penDown = 0;
        penState.erase = 0;
        penState.eraseRetryFrames = 0;
        penState.submit = 0;
        penState.promptRequest = 1;
        s_roundPhase = ROUND_PHASE_WAITING_PROMPT;
        xSemaphoreGive(penStateMutex);
    }

    /* Initial runtime state: yellow, waiting for ESP32 prompt at center. */
    setLedColor(LED_ORANGE);

    PRINTF("Scheduler starting (6 tasks)\r\n");
    vTaskStartScheduler();

    /* Should never reach here */
    while (1) {
        __asm volatile ("nop");
    }
    return 0;
}
